{
    "repos" : [
        {
            "title": "NPEX",
            "desc": "Open-source patch recommendation system for Java Null Pointer Exceptions (NPE). NPEX helps developers to maintain their projects NPE-free by automatically generating compilable patches for NPE. Our automatic repair framework will be developed on the top of NPEX.",
            "url": "https://github.com/kupl/npex.git"
        },
        {
            "title": "Synthrl",
            "desc": "Open source program synthesizer based on enumerative search. To accelerate the synthesis procedure, it guides the enumerative search by learned model. Synthrl's DSL and enumerative search are used in our source technology #5 (designing patch language) and #8 (statistics based patch synthesis) respectively.",
            "url": "https://github.com/kupl/synthrl.git"
        },
        {
            "title": "ADAPT",
            "desc": "Open source white-box testing framework for deep neural networks. It adaptively changes neuron selection heuristic during testing of deep neural network. ADAPT's learning algorithm is used to enhance our source technology #3 (logic based patch validation).",
            "url": "https://github.com/kupl/adapt.git"
        },
        {
            "title": "Graphick",
            "desc": "Open source learning framework for generating graph-based heuristics for pointer analysis. It designed a feature language to automatically generate pointer analysis heuristics, and proposed an algorithm to generate the graph-based analysis heuristic by automatically generating the features. It can dramatically improve the performance of pointer analysis, which is closely related to our source technology #3 (logic based patch validation).",
            "url": "https://github.com/kupl/Graphick.git"
        },
        {
            "title": "Benchmark",
            "desc": "Our benchmark consisting of 1176 safety errors and 205 functional errors",
            "url": "https://github.com/kupl/starlab-benchmarks.git"
        }
    ]
}
